---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.DetailFailures
source: html/a864c247-702f-43ce-8c1b-eaa12ac0575b.htm
---
# BuiltInFailures.DetailFailures Properties

All eaves are already aligned.